In [60]:
import pandas as pd

In [61]:
l=[[30,60],[60,90,80],[20,60,50]]

In [62]:
dfl=pd.DataFrame(l)

In [63]:
d={'c1':[10,20,30,40],
   'c2':[10,20,30,40]
   }

In [64]:
pd.DataFrame(d)

   c1  c2
0  10  10
1  20  20
2  30  30
3  40  40

In [65]:
cus={'Food': ['chikan biryani','Dhosa','Khabha','Idli','High Protien','khadhi paneer','chola bhatura','ice cream','dhahi badha','samosa'],
     'Price':[100,200,350,200,500,150,250,350,150,500],
     'Rating':[3,5,1,4,2,4,1,3,2,5]}

In [66]:
# .DataFrame is a method
df=pd.DataFrame(cus)

In [67]:
df

             Food  Price  Rating
0  chikan biryani    100       3
1           Dhosa    200       5
2          Khabha    350       1
3            Idli    200       4
4    High Protien    500       2
5   khadhi paneer    150       4
6   chola bhatura    250       1
7       ice cream    350       3
8     dhahi badha    150       2
9          samosa    500       5

In [68]:
# .columns is a attribute
df.columns

Index(['Food', 'Price', 'Rating'], dtype='object')

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Food    10 non-null     object
 1   Price   10 non-null     int64
 2   Rating  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

In [70]:
dfl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int64
 1   1       3 non-null      int64
 2   2       2 non-null      float64
dtypes: float64(1), int64(2)
memory usage: 204.0 bytes

In [71]:
# .head() Top 5 Row
df.head()

             Food  Price  Rating
0  chikan biryani    100       3
1           Dhosa    200       5
2          Khabha    350       1
3            Idli    200       4
4    High Protien    500       2

In [72]:
# .tail() Last 5 Rows
df.tail()

            Food  Price  Rating
5  khadhi paneer    150       4
6  chola bhatura    250       1
7      ice cream    350       3
8    dhahi badha    150       2
9         samosa    500       5

In [73]:
#.head(n=6) To get Specific Record From Top 

df.head(6)

             Food  Price  Rating
0  chikan biryani    100       3
1           Dhosa    200       5
2          Khabha    350       1
3            Idli    200       4
4    High Protien    500       2
5   khadhi paneer    150       4

In [74]:
# #.tail(n=4) To get Specific Record From Last
df.tail(n=4)

            Food  Price  Rating
6  chola bhatura    250       1
7      ice cream    350       3
8    dhahi badha    150       2
9         samosa    500       5

In [75]:
df.head(n=100)

             Food  Price  Rating
0  chikan biryani    100       3
1           Dhosa    200       5
2          Khabha    350       1
3            Idli    200       4
4    High Protien    500       2
5   khadhi paneer    150       4
6   chola bhatura    250       1
7       ice cream    350       3
8     dhahi badha    150       2
9          samosa    500       5

#### Note:- In python We Can Use indexing and Slicing directly as it works on 1d Data but Here We Work on 2D Data (Dataframe)

In [76]:
# df['Food','Price']
# KeyError: ('Food', 'Price')

In [77]:
# Column Selection ,More tha one column 
df[['Food','Price']]

             Food  Price
0  chikan biryani    100
1           Dhosa    200
2          Khabha    350
3            Idli    200
4    High Protien    500
5   khadhi paneer    150
6   chola bhatura    250
7       ice cream    350
8     dhahi badha    150
9          samosa    500

## Row Selection And column Selection
### .loc[] Attribute is used to perform that
### .loc[row_based , col_based] 
### .loc[Row Selection , column Selection]
- Row Selection or row_based 
     - index
     - list_of_index
     - slicing
     - condition

**These Things are applied in First Argument of .loc[] Attribute**

- column Selection or col_based
  - col_name
  - list_of_cols
  
**These Things are applied in Second Argument of .loc[] Attribute**

In [78]:
# .loc[7] To get the record of 7th row (Row Selection)
df.loc[7]

Food      ice cream
Price           350
Rating            3
Name: 7, dtype: object

In [79]:
# .loc[[5,6]] To get the record of 5th or 6th row (Row Selection)
df.loc[[5,6]]

            Food  Price  Rating
5  khadhi paneer    150       4
6  chola bhatura    250       1

In [80]:
# df.loc[[5,6],'Food'] To get the record of 5th or 6th row (Row Selection) and only one 'Food' column (Column Selection)
df.loc[[5,6],'Food']

5    khadhi paneer
6    chola bhatura
Name: Food, dtype: object

In [81]:
# .loc[[5,6],['Food','Rating']] To get the record of 5th or 6th row (Row Selection) From 'Food' 'Rating' Column  (Column Selection)
df.loc[[5,6],['Food','Rating']]

            Food  Rating
5  khadhi paneer       4
6  chola bhatura       1

In [82]:
df.loc[7,'Food']

'ice cream'

In [83]:
df.loc[(df['Price']>200)]

            Food  Price  Rating
2         Khabha    350       1
4   High Protien    500       2
6  chola bhatura    250       1
7      ice cream    350       3
9         samosa    500       5

In [84]:
df.loc[(df['Price']>200) & (df['Rating']==9)]

Empty DataFrame
Columns: [Food, Price, Rating]
Index: []

In [85]:
df.loc[(df['Price']>200) & (df['Rating']==9) ,'Food']

Series([], Name: Food, dtype: object)

In [86]:
df.loc[(df['Price']>200) & (df['Rating']==9) ,['Food','Rating']]

Empty DataFrame
Columns: [Food, Rating]
Index: []

## Slicing only work for Row Selection

In [87]:
df.loc[:5]

             Food  Price  Rating
0  chikan biryani    100       3
1           Dhosa    200       5
2          Khabha    350       1
3            Idli    200       4
4    High Protien    500       2
5   khadhi paneer    150       4

In [88]:
df.loc[5::2]

            Food  Price  Rating
5  khadhi paneer    150       4
7      ice cream    350       3
9         samosa    500       5

In [89]:
df.loc[::-1]

             Food  Price  Rating
9          samosa    500       5
8     dhahi badha    150       2
7       ice cream    350       3
6   chola bhatura    250       1
5   khadhi paneer    150       4
4    High Protien    500       2
3            Idli    200       4
2          Khabha    350       1
1           Dhosa    200       5
0  chikan biryani    100       3

In [90]:
# df.loc[-1]
# KeyError: -1

In [91]:
# df.loc[-1:-3:-1]
# No Data

In [92]:
# df.loc[[-1,3]]
# KeyError: '[-1] not in index'

## Save df to csv 
#### df.to_csv("File_name",index=False)

In [93]:
df.to_csv("Food Review.csv",index=False)

## Save df to excel
#### df.to_excel("File_name",index=False)

In [94]:
df.to_excel("Food Review.xlsx",index=False)